Repository: OpenChain-KWG/Specification-Translation-KR
Catalog: Specification-Translation-KR-level1.tmx
Source language: en_us
Languages: ko

source: FOSS training materials covering the above topics (e.g., slide decks, online course, or other training materials).
ko: 위의 주제를 다루는 FOSS 교육 자료(예: 슬라이드 자료, 온라인 과정 혹은 이외 교육 자료)

source: G1: Know Your FOSS Responsibilities
ko: G1: 당신의 FOSS 책임을 이해하라

source: G2: Assign Responsibility for Achieving Compliance
ko: G2: Compliance 달성을 위한 책임을 할당하라

source: G3: Review and Approve FOSS Content
ko: G3: FOSS 내용을 검토하고 승인하라

source: G4: Deliver FOSS Content Documentation and Artifacts
ko: G4: FOSS 내용 문서 및 결과물을 제공하라

source: G5: Understand FOSS Community Engagement
ko: G5: FOSS 커뮤니티참여를 이해하라

source: G6: Certify Adherence to OpenChain Requirements
ko: G6: OpenChain 요구사항 준수를 인증하라

source: Goal 1: Know Your FOSS Responsibilities
ko: 목표 1: FOSS 책임 파악

source: Goal 2: Assign Responsibility for Achieving Compliance
ko: 목표 2: 컴플라이언스 달성을 위한 책임 할당

source: Goal 3: Review and Approve FOSS Content
ko: 목표 3: FOSS 내용 검토 및 승인

source: Goal 4: Deliver FOSS Content Documentation and Artifacts
ko: 목표 4: FOSS 내용 문서 및 결과물 제공

source: Goal 5: Understand FOSS Community Engagement
ko: 목표 5: FOSS 커뮤니티 참여 이해

source: Goal 6: Certify Adherence to OpenChain Requirements
ko: 목표 6: OpenChain 요건 준수 인증

source: Identification of legal expertise available to FOSS Compliance role(s) which could be internal or external.
ko: FOSS 컴플라이언스 담당자가 사용할 수 있는 내부 또는 외부의 법률 전문 지식의 식별

source: Identified Licenses - a set of FOSS licenses identified as a result of following an appropriate method of identifying such licenses.
ko: 식별된 라이선스 -해당 라이선스를 식별하기 위한 적절한 방법을 수행한 결과로 식별된 FOSS 라이선스의 집합.

source: Identified Licenses - a set of FOSS licenses identified as a result of following an appropriate method of identifying licenses that govern the Supplied Software.
ko: 식별된 라이선스 - 공급대상 소프트웨어에 적용되는 라이선스를 식별하기 위한 적절한 방법을 수행한 결과로 식별된 일련의 FOSS 라이선스

source: Identify External FOSS Liaison Function ("FOSS Liaison").
ko: 외부 FOSS 연락담당자의 역할을 정한다.

source: Identify FOSS Liaison Function ("FOSS Liaison").
ko: FOSS 연락담당자의 역할을 정한다.

source: Identify Internal FOSS Compliance Role(s).
ko: FOSS 컴플라이언스 내부 담당자(들)를 지정한다.

source: Identify source of legal expertise available to FOSS Compliance role(s).
ko: FOSS Compliance 담당자가 사용할 수 있는 법률 전문 지식의 제공처를 지정한다.

source: If all the requirements have been met for a given program, it would be considered OpenChain Conforming in accordance with version 1.2 of the specification.
ko: 만약 어떤 프로그램이 모든 요건을 충족한다면, 그 프로그램은 이 설명서 버전 1.2에 따라 OpenChain 준수 프로그램으로 인정될 것이다.

source: If all the requirements have been met for a given program, it would be considered OpenChain Conforming in accordance with version 1.1 of the specification. Verification Artifacts are not intended to be public, but could be provided under NDA or upon private request from the OpenChain organization to validate conformance.
ko: 어떤 프로그램이 모든 요구사항을 충족한다면, 그 프로그램은 이 설명서 버전 1.1에 따라 OpenChain 준수 프로그램으로 인정될 것이다. 검증 결과물은 공개할 것으로 의도한 것은 아니지만, 준수를 인증하기 위해 NDA(비공개합의) 하에서 또는 OpenChain 조직의 비공개 요청에 따라 제공될 수 있다.

source: If all the requirements have been met for a given program, it would be considered OpenChain Conforming in accordance with version 1.0 of the specification.
ko: 어떤 프로그램이 모든 요구사항을 충족한다면, 그 프로그램은 이 설명서 버전 1.0에 따라 OpenChain 준수 프로그램으로 인정될 것이다.

source: If an organization permits contributions to FOSS projects then a process exist that implements the FOSS contribution policy outlined in Section 5.1.
ko: FOSS 프로젝트에 기여하는 것을 허용하는 조직이라면 5.1절에 설명한 FOSS 기여 정책을 구현하는 프로세스가 존재한다.

source: If an organization permits contributions to FOSS projects then a process must exist that implements the FOSS contribution policy outlined in Section 5.1.
ko: FOSS 프로젝트에 기여하는 것을 허용한 조직이라면 5.1절에 설명한 FOSS 기여 정책을 구현하는 프로세스를 가져야 한다.

source: In accordance with the Vision and Mission, this specification defines a set of requirements that if met, would significantly increases the probability that an open source compliance program had achieved a sufficient level of quality, consistency and completeness; although a program that satisfies all the specification requirements does not guarantee full compliance.
ko: 비전과 사명에 따라 이 설명서 일련의 요구사항을 정의하고, 이 요구사항이 충족하는 오픈소스 프로그램이라면 충분한 수준의 품질, 일관성 및 완전성을 달성했을 가능성을 높일 것이다. 다만, 설명서의 모든 요구사항을 만족하는 프로그램이라도 완전한 Compliance가 보장되는 것은 아니다.

source: In order for an organization to be OpenChain certified, it must affirm that it has a FOSS management program that meets the criteria described in this OpenChain Specification version 1.2.
ko: 조직이 OpenChain 인증을 받으려면, OpenChain 설명서 1.2 버전의 기준을 충족하는 FOSS 관리 프로그램이 있음을 확약해야 한다.

source: In order for an organization to be OpenChain certified, it must affirm that it has a FOSS program that meets the criteria described in this OpenChain Conformance Specification version 1.0.
ko: 조직이 OpenChain 인증을 받으려면, OpenChain 준수 설명서 1.0버전의 기준을 충족하는 FOSS 프로그램이 있음을 확약해야 한다.

source: In order for an organization to be OpenChain certified, it must affirm that it has a FOSS management program that meets the criteria described in this OpenChain Specification version 1.1.
ko: 조직이 OpenChain 인증을 받으려면, OpenChain 설명서 1.1 버전의 기준을 충족하는 FOSS 관리 프로그램이 있음을 확약해야 한다.

source: In that situation it is understood that no procedure may exist and this requirement would nevertheless be met.
ko: 기여가 일체 허용되지 않는 정책도 존재할 수 있음. 그 경우 어떤 절차도 존재하지 않지만 그럼에도 이 요구사항은 충족되는 것으로 이해됨.

source: In that specific situation it is understood that no process may exist and this requirement would nevertheless be met.
ko: 이러한 특정 상황에서는 어떤 프로세스도 존재하지 않을 수 있으며, 그럼에도 이 요구사항은 충족되는 것이다.

source: In the event there is confusion between a translation and the English version, The English text shall take precedence.
ko: 번역본과 영문본 사이에 불일치가 있는 경우, 영문 문서가 우선합니다.

source: In the situation where contributions are limited or not permitted at all, a policy should exist making that position clear.
ko: 기여가 제한적이거나, 전혀 허용되지 않는 상황이라면, 이를 명확히 하는 정책이 있어야 한다.

source: In the situation where contributions are not permitted at all, a policy should exist making that position clear.
ko: 기여가 전혀 허용되지 않는 상황이라면, 이를 명확히 하는 정책이 있어야 한다.

source: Introduction
ko: 제1절 소개

source: It has been translated from the original English text.
ko: 원본인 영문 문서가 번역되었습니다.

source: It is important for the organization to remains current with the specification if they want to assert program conformance overtime. This requirement ensures that the program’s supporting processes and controls do not erode if they want to continue to assert conformance with the specification overtime.
ko: 조직이 시간이 지나도 프로그램 준수를 주장하고자 한다면 현재에도 설명서가 조직에서 통용되는 것이 중요하다. 이 요구사항은 조직이 시간이 지나도 계속해서 설명서를 준수하고 있음을 주장하려는 경우 프로그램의 지원 프로세스와 통제가 약화되지 않았음을 보장하기 위함

source: It is important for the organization to remains current with the specification if that organization wants to assert program conformance overtime.
ko: 조직이 시간이 지난 후에도 프로그램 준수를 주장하고자 한다면 현재에도 설명서가 조직에서 통용되는 것이 중요.

source: Legal expertise pertaining to FOSS compliance is accessible to the FOSS Compliance role (e.g., could be internal or external); and
ko: FOSS Compliance 담당자는 FOSS Compliance에 대한 (내외부) 법률 전문 지식에 접근할 수 있다; 그리고

source: Mandatory FOSS training for all Software Staff exists such that:
ko: 모든 소프트웨어 공급담당자를 대상으로 다음과 같은 필수 FOSS 교육이 존재한다

source: Method of tracking the completion of the course for all Software Staff.
ko: 모든 소프트웨어 공급담당자가 과정을 완료하였는지 추적하는 방법.

source: Mission: Establish requirements to achieve effective management of free/open source software (FOSS) for software supply chain participants, such that the requirements and associated collateral are developed collaboratively and openly by representatives from the software supply chain, open source community, and academia.
ko: 사명: 소프트웨어 공급망 참가자를 위해, FOSS의 효과적인 관리를 위한 요구사항을 수립하여 요구사항 및 부수적인 관련 사항을 소프트웨어 공급망, 오픈소스 Community 및 학계의 대표들이 공동으로 그리고 공개적으로 개발할 수 있도록 한다.

source: Name of persons, group or function in FOSS Compliance role(s) internally identified.
ko: 내부적으로 지정된 FOSS 컴플라이언스 담당자, 조직 혹은 직무 이름.

source: Name of persons, group or function in FOSS Compliance role(s) identified.
ko: 지정된 FOSS Compliance 담당자들, 조직 혹은 직무 이름.

source: OpenChain Conforming - a program that satisfies all the requirements of this specification.
ko: OpenChain 준수 프로그램 - 이 설명서의 모든 요구사항을 충족하는 프로그램.

source: OpenChain Conformance Specification
ko: OpenChain 준수 설명서

source: OpenChain Conformance Specification 1.0
ko: OpenChain 준수 설명서 1.0

source: OpenChain Conforming – a program that satisfies all the requirements of this specification.
ko: OpenChain 준수 프로그램 -이 설명서의 모든 요구사항을 충족하는 프로그램.

source: OpenChain Specification
ko: OpenChain 설명서

source: OpenChain Specification 1.1
ko: OpenChain 설명서 1.1

source: OpenChain Conforming Program- a program that satisfies all the requirements of this specification.
ko: OpenChain 준수 프로그램-이 설명서의 모든 요건을 충족하는 프로그램.

source: OpenChain Specification 1.2(Temp)
ko: OpenChain Specification 1.2

source: Prepare the following Distributed Compliance Artifacts to accompany the Supplied Software as required by the corresponding Identified Licenses which might include (but is not limited to) the required:
ko: 해당 식별된 라이선스에서 요구하는 대로 공급대상 소프트웨어에 수반할 다음과 같은 배포할 Compliance 결과물(다음에 국한되지 않음)을 준비한다:

source: Process for identifying, recording and/or tracking of FOSS components contained in Supplied Software.
ko: 공급 대상 소프트웨어 포함된 FOSS Component의 식별, 기록 및 추적을 위한 프로세스.

source: Provided the FOSS contribution policy permits contributions, a documented procedure that governs FOSS contributions.
ko: FOSS 기여 정책이 기여를 허용하는 경우, FOSS 기여를 관리하는 문서화된 절차.

source: Provided the FOSS contribution policy permits contributions, a documented procedure exists that describes the FOSS contribution process.
ko: FOSS 기여 정책이 이러한 기여 활동을 허용하는 경우, FOSS 기여 절차를 설명하는 문서화된 프로세스가 존재한다.

source: Provided the FOSS contribution policy permits such contributions, a process exists for confirming contributions adhere to the FOSS contribution policy, which might include (but is not limited to) the following considerations:
ko: FOSS 기여 정책이 이러한 기여 활동을 허용하는 경우, 다음을 포함하는 (그러나 이에 국한되지는 않는) FOSS 기여 정책을 준수하는지 확인하기 위한 프로세스가 존재한다:

source: Publicly identify a means by which one can contact the FOSS Liaison.
ko: FOSS 연락담당자에게 연락할 수 있는 방법을 공개적으로 밝힌다.

source: Publicly identify means of contacting the FOSS Liaison by way of electronic communication.
ko: 전자 통신을 통해 FOSS 연락담당자에게 연락할 방법을 정해서 공개한다.

source: Publicly visible identification of FOSS Liaison (e.g., via a published contact email address, or the Linux Foundation's Open Compliance Directory).
ko: 공개적으로 식별 가능한 FOSS 연락담당자의 ID (예: 공개된 이메일 주소, 또는 Linux Foundation의 Open Compliance Directory.)

source: Rationale:
ko: 이유:

source: Requirements
ko: 제3절 요건

source: SPDX or Software Package Data Exchange - the format standard created by the SPDX Working Group for exchanging license and copyright information for a given software package.
ko: SPDX (Software Package Data Exchange) – 소프트웨어 패키지에 대한 라이선스 및 저작권 정보를 교환하기 위해 SPDX 워킹 그룹이 만든 표준 형식이다.

source: SPDX or Software Package Data Exchange – the format standard created by the SPDX Working Group for exchanging license and copyright information for a given software package.
ko: SPDX (Software Package Data Exchange) – 소프트웨어 패키지에 대한 라이선스 및 저작권 정보를 교환하기 위해 SPDX 워킹 그룹이 만든 표준 형식이다.

source: Section 2 introduces definitions of key terms used throughout the specification.
ko: 제2절에서는 설명서 전체에 걸쳐서 사용되는 주요 용어의 정의를 소개한다.

source: Section 3 presents the specification requirements where each one has a list of one or more Verification Artifacts.
ko: 제3절에서는 각 설명서 요구사항을 나타내는데, 각 요구사항에 대해 하나 혹은 그 이상의 검증 결과물 목록을 제시한다.

source: Section 3 presents the specification requirements where each one has a list of one or more Verification Materials.
ko: 제3절에서는 각 설명서 요건을 나타내는데, 각 요건에 대해 하나 혹은 그 이상의 검증 자료를 제시한다.

source: Software Staff - any employee or contractor that defines, contributes to or has responsibility for preparing Supplied Software.
ko: 소프트웨어 공급 담당자 - 공급대상 소프트웨어의 범위를 정의하거나, 그 소프트웨어에 기여하거나, 그를 준비하는 책임을 지는 모든 직원 또는 수급인.

source: Software Staff must have completed FOSS training within the last 24 months (to be considered current).
ko: 소프트웨어 공급담당자는 최근 24개월 내 FOSS 교육을 이수하였어야 한다(‘현재 교육 이수 상태’).

source: Software Staff must have completed FOSS training within the last 24 months to be considered current (“Currently Trained”). A test may be used to allow Software Staff to satisfy the training requirement.
ko: 소프트웨어 공급담당자는 현재 교육 이수 상태로 인정되기 위해서 지난 24개월 내 FOSS 교육을 이수하였어야 한다(‘현재 교육 이수 상태’). 소프트웨어 공급담당자가 교육 요건을 충족할 수 있도록 하기 위해 테스트가 행해질 수 있다.

source: Software Staff roles and responsibilities pertaining to FOSS compliance specifically and the FOSS policy in general; and
ko: 세부적인 FOSS Compliance 및 전반적인 FOSS 정책에 관한 소프트웨어 공급담당자의 역할 및 책임;

source: Supplied Software - software that an organization delivers to third parties (e.g., other organizations or individuals).
ko: 공급대상 소프트웨어 -한 조직에서 제3자(예: 다른 조직 혹은 개인)에게 제공(인도, 양도)하는 소프트웨어.

source: Supplied Software – software that an organization delivers to third parties (e.g., other organizations or individuals).
ko: 공급대상 소프트웨어 -한 조직에서 제3자(예: 다른 조직 혹은 개인)에게 제공(인도, 양도)하는 소프트웨어.

source: The FOSS Compliance role and the FOSS Liaison may be the same individual.
ko: FOSS Compliance 담당자와 FOSS 연락담당자는 동일 개인이 될 수 있다.

source: The 85% may not necessarily refer to the entire organization, but to the totality Software Staff governed by the OpenChain Conforming program.
ko: 85%는 반드시 전체 조직을 지칭하는 것이 아니고, OpenChain 준수 프로그램이 적용되는 전체 소프트웨어 공급담당자를 지칭할 수 있다.

source: The OpenChain Initiative began in 2013 when a group of software supply chain open source practitioners observed two emerging patterns: 1) significant process similarities existed among organizations with mature open source compliance programs; and 2) there still remained a large number of organizations exchanging software with less developed programs.
ko: OpenChain Initiative는 2013년, 소프트웨어 공급망 오픈소스 전문가 그룹이 다음과 같은 두 가지 새로운 패턴을 관찰하면서 시작되었다. : 1) 성숙한 오픈소스 컴플라이언스 프로그램이 있는 조직 간에는 중요한 절차적 유사성이 존재함; 2) 덜 발달된 프로그램으로 소프트웨어를 거래하는 조직도 여전히 많이 존재하고 있음.

source: The FOSS management program must be capable of handling common FOSS license use cases encountered by Software Staff for Supplied Software, which may include the following use cases (note that the list is neither exhaustive, nor may all of the use cases apply):
ko: FOSS 관리 프로그램은 공급대상 소프트웨어에 대해 소프트웨어 공급관리자가 접하게 되는 일반적인 FOSS 라이선스 사용 사례를 처리할 수 있어야 하며, 다음과 같은 사용 사례가 포함될 수 있다. (아래 각호가 모든 경우를 포함하지는 않으며, 모든 사항이 적용되는 것은 아님) :

source: The FOSS Compliance role and the FOSS Liaison can be the same individual.
ko: FOSS Compliance 담당자와 FOSS 연락담당자는 동일 개인이 될 수 있다.

source: The FOSS contribution policy can be made a part of the overall FOSS policy of an organization or be its own separate policy.
ko: FOSS 기여 정책은 조직의 전체 FOSS 정책의 일부로 만들 수도 있고, 자체적인 별도의 정책으로 만들 수도 있다.

source: The FOSS policy and where to find a copy;
ko: FOSS 정책 및 사본을 찾을 수 있는 곳;

source: The FOSS program must be capable of handling typical FOSS use cases encountered by Software Staff for Supplied Software, which may include the following use cases - when parts of the Supplied Software (note that the below list is neither exhaustive, nor may all of the below use cases apply depending on the organization):
ko: FOSS 프로그램은 공급대상 소프트웨어에 대해 소프트웨어 공급관리자가 접하게 되는 일반적인 FOSS 사용 사례를 처리할 수 있어야 하고, 사용 사례는 공급대상 소프트웨어의 일부가 다음 각호에 해당할 경우를 포함할 수 있다(아래 각호가 모든 경우를 포함하지는 않으며 조직에 따라 아래의 모든 사항이 적용되는 것은 아님). :

source: The Vision and Mission of the OpenChain Initiative are as follows:
ko: OpenChain Initiative의 비전과 사명은 다음과 같다:

source: The collection may include (but are not limited to) one or more of the following: source code, attribution notices, copyright notices, copy of licenses, modification notifications, written offers, FOSS component bill of materials, SPDX documents and so forth.
ko: 이 집합에는 다음 중 하나 이상이 포함될 수 있다 (단, 이에 국한되지 않음): 소스 코드, 저작자 고지, 저작권 고지, 라이선스 사본, 수정 내용 고지, 서면 청약, FOSS 컴포넌트 BOM (bill of materials), SPDX 문서 등.

source: The details of the policy and available translations can be found on the OpenChain project specification webpage.
ko: 정책 및 사용 가능한 번역에 대한 자세한 내용은 OpenChain 프로젝트 설명서 웹 페이지에서 확인할 수 있습니다.

source: The latter observation resulted in a lack of trust in the consistency and quality of the Compliance Artifacts accompanying the software being exchanged.
ko: 여기에서 두 번째 패턴은 소프트웨어 거래 시 수반하는 컴플라이언스 결과물의 일관성 및 품질에 대한 신뢰가 결여되는 결과를 가져왔다.

source: The latter observation resulted in a lack of trust in the consistency and quality of the compliance artifacts accompanying the software being exchanged.
ko: 여기에서 두 번째 패턴은 소프트웨어 거래 시 동반하는 컴플라이언스 결과물의 일관성 및 품질에 대한 신뢰가 결여되는 결과를 가져왔다.

source: The mere meeting of a subset of these requirements would not be considered sufficient.
ko: 이러한 요건의 일부를 충족하는 것 만으로는 충분하다고 인정되지 않는다.

source: The organization affirms the existence of a FOSS management program that meets all the requirements of this OpenChain Specification version 1.2 within the past 18 months of achieving conformance validation.
ko: 조직은 준수 인증을 받은 후 18개월 동안 이 OpenChain 설명서 1.2 버전의 모든 요건을 충족하는 FOSS 관리 프로그램이 존재함을 확약한다.

source: The organization affirms that a program exists that meets all the requirements of this OpenChain Conformance Specification version 1.0.
ko: 조직은 이 OpenChain 준수 설명서의 모든 요구 사항을 충족하는 프로그램이 존재함을 확약한다.

source: The recorded inventory also serves as evidence that the process was followed.
ko: 이 기록된 목록은 프로세스가 수행되었다는 증거로도 사용된다.

source: The specification focuses on the “what” and “why” qualities of a compliance program as opposed to the “how” and “when” considerations.
ko: 이 설명서는 "어떻게"와 "언제"에 대한 고려가 아닌 컴플라이언스 프로그램의 "무엇"과 "왜"에 대해 초점을 맞추고 있다.

source: The specification is licensed under the Creative Commons Attribution License 4.0 (CC-BY-4.0).
ko: 본 설명서는 크리에이티브 커먼즈 애트리뷰션 라이선스 4.0(CC-BY-4.0)에 따라 이용허락됩니다.

source: The study group evolved into a work group, and in April 2016, formally organized as a Linux Foundation collaborative project.
ko: 이 스터디 그룹은 워크 그룹으로 발전하였으며, 2016년 4월에는 Linux Foundation Collaborative Project로 정식 조직되었다.

source: The training, as a minimum, covers the following topics:
ko: 교육은 최소한 다음 주제를 다룬다:

source: The training, at a minimum, covers the following topics:
ko: 교육은 최소한 다음 주제를 다룬다:

source: They include (but are not limited to) the following: copyright notices, copies of licenses, modification notifications, attribution notices, source code, written offers and so forth.
ko: 여기에는 다음 사항이 포함된다 (이에 국한되지 않음) : 저작권 고지, 라이선스 사본, 수정 내용 고지, 저작자 고지, 소스 코드, 서면 청약 등.

source: They represent the evidence that must exist in order for a given requirement to be considered satisfied.
ko: 이들은 어떤 요건이 충족된 것으로 인정되기 위해 필요한 증거이다.

source: This document is licensed under the Creative Commons Attribution 4.0 International (CC-BY 4.0) license.
ko: 이 문서는 Creative Commons Attribution 4.0 International (CC-BY-4.0)에 따라 이용허락됩니다.

source: This document is licensed under the Creative Commons Attribution 4.0 International (CC-BY 4.0) license. A copy of the license can be found at https://creativecommons.org/licenses/by/4.0/.
ko: 이 문서는 크리에이티브 커먼즈 애트리뷰션 라이선스 인터네셔널 4.0(CC-BY-4.0)에 따라 이용허락됩니다. 그 라이선스의 사본은 여기서는 얻을 수 있습니다https://creativecommons.org/licenses/by/4.0/.

source: This ensures a practical level of flexibility that enables different organizations to tailor their policies and processes to best fit their objectives.
ko: 이는 서로 다른 조직이 각자의 목적에 가장 잘 부합하도록 정책과 프로세스를 조정할 수 있게 하는 실질적인 유연성을 보장한다.

source: This inventory must exist to support the systematic review of each component’s license terms to understand their respective distribution obligations and restrictions applicable to the Supplied Software.
ko: 이 목록은 공급대상 소프트웨어에 적용되는 배포 관련 의무 및 제한 사항을 이해하기 위해 각 Component의 라이선스 조항을 체계적으로 검토할 수 있도록 존재해야 한다.

source: This is an official translation from the OpenChain Project.
ko: 이 문서는 OpenChain Project의 공식 번역본입니다.

source: This requirement ensures that the program’s supporting processes and controls do not erode if the conforming organization continue to assert conformance overtime.
ko: 이 요건은 준수 조직이 시간이 지나도 계속해서 준수를 주장하는 경우 프로그램의 지원 프로세스와 통제가 약화되지 않았음을 보장하기 위함.

source: This set is referred to as the Compliance Artifacts which may include (but are not limited to) one or more of the following: source code, attribution notices, copyright notices, copy of licenses, modification notifications, written offers, SPDX documents and so forth.
ko: 이 집합을 Compliance 결과물이라고 하고, 다음 사항이 포함된다 (이에 국한되지 않음) : 소스 코드, 저작자 고지, 저작권 고지, 라이선스 사본, 수정 내용 고지, 서면 청약, SPDX 문서 등.

source: Time to perform the role has been allocated; and
ko: 역할을 수행할 시간이 배정된다; 그리고

source: To ensure the program is sufficiently robust to handle an organization’s common FOSS license use cases.
ko: FOSS 관리 프로그램이 조직의 일반적인 FOSS 라이선스 사용 사례를 충분히 활발하게 다루도록 보장하기 위함.

source: To cause the FOSS program to be sufficiently robust to address that organization’s typical use cases as a result of that organization’s business practices.
ko: 해당 조직의 실제 사업 결과, FOSS 프로그램이 전형적인 사용 사례를 충분히 활발하게 다루도록 보장하기 위함.

source: To ensure an organization has a documented process for how the organization publicly contributes FOSS.
ko: 공개적으로 FOSS에 기여하는 방법에 대한 문서화된 프로세스를 조직이 갖도록 보장하기 위함.

source: To ensure an organization has given reasonable consideration to developing a policy with respect to publicly contributing to FOSS.
ko: FOSS에 대한 공개적 기여와 관련한 정책 개발을 위해 조직이 합당한 고려를 하도록 보장하기 위함.

source: To ensure the Software Staff have recently attended FOSS training and that a core set of relevant FOSS topics were covered in the training.
ko: 소프트웨어 공급관리자가 최근 FOSS 교육에 참석하고, 교육에서 일련의 관련 핵심 FOSS 주제를 다루도록 보장하기 위함.

source: To ensure the complete collection of Compliance Artifacts accompany the Supplied Software as required by the Identified Licenses along with other reports created as part of the FOSS review process.
ko: 식별된 라이선스에 따라 요구되는 컴플라이언스 결과물의 집합이 FOSS 검토 프로세스의 일부로 작성된 기타 보고서와 함께 공급대상 소프트웨어에 수반하도록 보장하기 위함.

source: To ensure a process exists for creating and managing a FOSS component bill of materials used to construct the Supplied Software.
ko: 공급대상 소프트웨어를 제작하기 위해 사용된 FOSS Component 구성목록(BOM)을 작성하고 관리하기 위한 프로세스가 존재하도록 보장하기 위함.

source: To ensure a process exists for reviewing and identifying the license obligations for each Identified License for the various use cases.
ko: 다양한 사용 사례에 대해 각 식별된 라이선스에 대한 라이선스 의무를 검토하고 식별하기 위한 프로세스가 존재하도록 보장하기 위함

source: To ensure a process exists for identifying and listing all FOSS components used to construct the Supplied Software.
ko: 공급대상 소프트웨어를 제작하기 위해 사용된 모든 FOSS Component들을 확인 및 목록화하기 위한 프로세스가 존재하도록 보장하기 위함.

source: To ensure steps are taken to create, record and make Software Staff aware of the existence of a FOSS policy.
ko: FOSS 정책을 수립 및 기록하고 이 존재를 소프트웨어 공급담당자가 인식하게 하는 조치가 취해지도록 보장하기 위함.

source: To ensure that if an organization declares that it has a program that is OpenChain Conforming, that such program has met all the requirements of this specification.
ko: 조직이 OpenChain 을 준수하는 프로그램을 가지고 있다고 선언하면, 해당 프로그램이 이 설명서의 모든 요구사항을 충족하도록 보장하기 위함.

source: To facilitate global adoption we welcome efforts to translate the specification into multiple languages.
ko: 국제적인 채택을 용이하게 하기 위해 설명서를 여러 언어로 번역하려는 노력을 환영한다.

source: Verification Material(s):
ko: 검증 자료

source: Verification Artifact(s):
ko: 검증 결과물:

source: Verification Artifacts - evidence that must exist in order for a given requirement to be considered satisfied.
ko: 검증 결과물 - 주어진 요구사항을 충족한 것으로 판단하기 위해 존재해야 하는 증거.

source: Verification Materials - evidence that must exist in order for a given requirement to be considered satisfied.
ko: 검증 자료 - 주어진 요건이 충족되는 것으로 인정되기 위해 존재해야 하는 증거.

source: Verification Materials are not intended to be public, but could be provided under NDA or upon private request from the OpenChain organization to validate conformance.
ko: 검증 자료는 공개용으로 작성된 것은 아니지만, 준수를 인증하기 위해 NDA(비공개합의) 하에서 또는 OpenChain 조직의 개별적 요청에 따라 제공될 수 있다.

source: Version 1.0
ko: 버전 1.0

source: Version 1.2
ko: 버전 1.2

source: Version 1.1
ko: 버전 1.1
